app/Http/Controllers/Auth/RegisterBusinessUserController.php

    public function showBusinessRegisterForm($id = null){

        if($id != null){
            $get_register_val = YpBusinessUsers::where('business_userid',$id)->get()->toArray();
---
select * from `yp_business_users` where `business_userid` = '6819415468078'

        $last_three = substr($_POST['last_name'], 0, 3);
        $makepassword = $first_three.$last_three.'@123';
        if(!empty($id)){
            $YpBusinessUser = YpBusinessUsers::where('business_userid', '=',  $id)->first();
---
select * from `yp_business_users` where `business_userid` = '6819415468078' limit 1

            }else{
                $YpBusinessUser->logitude = '';
            }
            $YpBusinessUser->save();
---
update `yp_business_users` set `logitude` = 76.7178726, `updated_at` = '2019-01-28 12:35:09' where `id` = 30

    public function showBusinessRegisterForm_two($id){
        $get_register_val = YpBusinessDetails::where('business_userid',$id)->get()->toArray();
---
select * from `yp_business_details` where `business_userid` = '8826654271814'

    public function create_two($id){

        $business_userid = $id;

        $get_businessuser_id = YpBusinessUsers::where('business_userid',$business_userid)->get(['id'])->toArray();
        $business_id = $get_businessuser_id[0]['id'];

        $validator = Validator::make($_POST, [
            'url' => ['string', 'max:255'],
            'fb_url' => ['string', 'max:255'],
           // 'password' => ['required', 'string', 'min:6', 'confirmed'],
        ]);

        if($validator->fails()) {

            return redirect()->url('/business_user/register_two'.$business_userid)->withInput()->withErrors($validator);
        }

        $check_bu_details = YpBusinessDetails::where('b_id',$business_id)->get()->toArray();
---
select `id` from `yp_business_users` where `business_userid` = '1513864548196'
select * from `yp_business_details` where `b_id` = 44


        }

        YpBusinessUsers::where('business_userid',$business_userid)->update(['completed_steps'=>'2']);
---
update `yp_business_users` set `completed_steps` = '2', `updated_at` = '2019-01-28 15:32:47' where `business_userid` = '1513864548196'

    public function showBusinessRegisterForm_three($id){
        //die('here');
        $userCategoryModel = new YpBusinessUsercategories();
        $get_register_val = YpBusinessDetails::where('business_userid',$id)->get()->toArray();
        $all_categories =  YpBusinessCategories::with('sub_category')->where('category_status',1)->whereHas('sub_category', function($q) {$q->where('sub_category_status',1);})->get();
        $business_categories =  $this->get_user_categories($id);
        //print'<pre>vfg';print_r($business_categories); echo '</pre>';
        return view('auth.register_business_user_three')->with(array('id'=>$id,'get_register_val'=>$get_register_val,'categories'=>$all_categories,'business_categories'=>$business_categories));
---
select * from `yp_business_details` where `business_userid` = '6819415468078'
select * from `yp_business_categories`
select * from `yp_business_users` where `business_userid` = '6819415468078' limit 1

    public function create_three($id){
        $YpBusinessUser = YpBusinessUsers::where('business_userid', '=',  $id)->first();
        $YpBusinessUser->completed_steps = 3;
        $YpBusinessUser->save();
---
select * from `yp_business_users` where `business_userid` = '5486170358141' limit 1
update `yp_business_users` set `completed_steps` = 4, `updated_at` = '2019-01-28 12:22:51' where `id` = 31

    public function showBusinessRegisterForm_four($id){
        $grapic_details = YpBusinessDetails::where('business_userid',$id)->select('distance_all','distance_kms')->get()->toArray();
        //echo '<pre>';print_r($grapic_details); echo '</pre>';
        return view('auth.register_business_user_four')->with(array('id'=>$id,'grapic_details'=>$grapic_details));
---
select * from `yp_business_details` where `business_userid` = '6819415468078' limit 1

            }
         }

        $YpBusinessUser = YpBusinessUsers::where('business_userid', '=',  $id)->first();
        $YpBusinessUser->completed_steps = 6;
        $YpBusinessUser->save();
---
select * from `yp_business_users` where `business_userid` = '6819415468078'
update `yp_business_users` set `completed_steps` = 7, `updated_at` = '2019-01-28 12:51:43' where `id` = 30