app/Http/Controllers/Auth/RegisterBusinessUserController.php


        }

        YpBusinessUsers::where('business_userid',$business_userid)->update(['completed_steps'=>'2']);
---
update `yp_business_users` set `completed_steps` = 3, `updated_at` = '2019-01-28 12:35:18' where `id` = 30

    public function showBusinessRegisterForm_three($id){
        //die('here');
        $userCategoryModel = new YpBusinessUsercategories();
        $get_register_val = YpBusinessDetails::where('business_userid',$id)->get()->toArray();


        $all_categories =  YpBusinessCategories::get();


        $business_categories =  $this->get_user_categories($id);

        // $all_categories =  YpBusinessCategories::with('sub_category')->where('category_status',1)->whereHas('sub_category', function($q) {$q->where('sub_category_status',1);})->get();
        // $business_categories =  $this->get_user_categories($id);



        //print'<pre>vfg';print_r($business_categories); echo '</pre>';
        return view('auth.register_business_user_three')->with(array('id'=>$id,'get_register_val'=>$get_register_val,'categories'=>$all_categories,'business_categories'=>$business_categories));
---
select * from `yp_business_details` where `business_userid` = '5486170358141' limit 1

    public function showBusinessRegisterForm_five($id){
        $userDetails = YpBusinessDetails::where('business_userid', '=',  $id)->get()->toArray();
        //echo '<pre>';print_r($userDetails); echo '</pre>';
        return view('auth.register_business_user_five')->with(array('id'=>$id,'userDetails'=>$userDetails));
---
select * from `yp_business_users` where `business_userid` = '6819415468078' limit 1