app/Models/YpBusinessUserCategories.php

select distinct `y_b_u_c`.`category_id`, `y_b_c`.`category_name` from `yp_business_user_categories` as `y_b_u_c` inner join `yp_business_categories` as `y_b_c` on `y_b_u_c`.`category_id` = `y_b_c`.`category_id` where `y_b_u_c`.`business_userid` = '7186766585648'
---
    public function get_user_categories($user_id)
    {
        $business_category_ids = DB::table('yp_business_user_categories AS y_b_u_c')->where('y_b_u_c.business_userid',$user_id)
        		->join('yp_business_categories AS y_b_c', 'y_b_u_c.category_id', '=', 'y_b_c.category_id')
        		->distinct()
	        	->select('y_b_u_c.category_id','y_b_c.category_name')
	        	->get()->toArray();